src/cf/InformationRegisters/ОбъектыИнтегрированныеС1СДокументооборотом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыИнтегрированныеС1СДокументооборотом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДополнительныеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОбъектаДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
					<Comment>(Общ) Ставка НДС 22%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22_122</Name>
					<Comment>(Общ) Расчетная ставка НДС 22% / 122%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>(Общ) Расчетная ставка НДС 20% / 120%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>(Общ) Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>(Общ) Расчетная ставка НДС 18% / 118%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>(Общ) Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>(Общ) Расчетная ставка НДС 10% / 110%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
					<Comment>(Общ) Ставка НДС 7%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7_107</Name>
					<Comment>(Общ) Расчетная ставка НДС 7% / 107%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
					<Comment>(Общ) Ставка НДС 5%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5_105</Name>
					<Comment>(Общ) Расчетная ставка НДС 5% / 105%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерсональныеДанныеСкрыты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позывной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Добавление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удаление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/уатИнтеграцияС1СДокументооборот/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура вызывается из обработчика Форма.ПриСозданииНаСервере
// Параметры:
//	Форма - форма документа
//
Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	Попытка
		Если Форма.Элементы.Найти("ГруппаСогласование") <> Неопределено Тогда 
			
			ИмяФормыМассив = СтрРазделить(Форма.ИмяФормы, ".");
			ИмяОбъекта = СтрШаблон("%1.%2", ИмяФормыМассив[0], ИмяФормыМассив[1]);
			Правила = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.НайтиСоздатьПодходящиеПравила(
			Неопределено,
			ИмяОбъекта,
			Ложь);
			
			ДобавлятьСостояние = (Правила.Количество() <> 0);
			Если ДобавлятьСостояние Тогда 
				Форма.Элементы.ГруппаСогласование.ВертикальноеПоложениеВГруппе     = ВертикальноеПоложениеЭлемента.Центр;
				Форма.Элементы.ГруппаСогласование.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
				ГруппаСогласованиеДО = Форма.Элементы.Добавить(
					"СогласованиеДО",
					Тип("ГруппаФормы"),
					Форма.Элементы.ГруппаСогласование);
					ГруппаСогласованиеДО.Вид                 = ВидГруппыФормы.ОбычнаяГруппа; 
					ГруппаСогласованиеДО.ОтображатьЗаголовок = Ложь;
					ГруппаСогласованиеДО.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 

					КомандаОбновить = Форма.Команды.Добавить("_ОбновитьСостояниеСогласованиеДО");
					КомандаОбновить.Действие    = "Подключаемый_уатВыполнитьКоманду";
					КомандаОбновить.Заголовок   = НСтр("en='Update';ru='Обновить'");
					КомандаОбновить.Подсказка   = НСтр("ru = 'Обновить состояние в 1С:Документообороте'; en = 'Update the status in 1C:Document Management'");
					КомандаОбновить.Картинка    = БиблиотекаКартинок.Обновить;
					КомандаОбновить.Отображение = ОтображениеКнопки.Картинка;
					
					кнОбновитьСостояние = Форма.Элементы.Добавить("_ОбновитьСостояниеСогласованиеДО", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСогласование);
					кнОбновитьСостояние.ИмяКоманды = "_ОбновитьСостояниеСогласованиеДО";
					кнОбновитьСостояние.Вид        = ВидКнопкиФормы.Гиперссылка;
					кнОбновитьСостояние.Ширина     = 3;
	
					ЗаголовокСогласованиеДО = Форма.Элементы.Добавить("ЗаголовокСогласованиеДО", Тип("ДекорацияФормы"), ГруппаСогласованиеДО);
					ЗаголовокСогласованиеДО.Заголовок = Нстр("ru = 'Согласование в 1С:Документообороте:'; en = 'Coordination in 1C:Document Management:'"); 
					
					ДобавляемыеРеквизиты = Новый Массив();
					ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
					"ИнтеграцияС1СДокументооборотом_СостояниеДО",
					Новый ОписаниеТипов("Строка"),,
					НСтр("ru = 'Состояние'; en = 'State'")));
					
					ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
					"ИнтеграцияС1СДокументооборотом_УстановилСостояниеДО",
					Новый ОписаниеТипов("Строка"),,
					НСтр("ru = 'Установил'; en = 'Installed'")));
					
					ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
					"ИнтеграцияС1СДокументооборотом_ДатаУстановкиСостояниеДО",
					Новый ОписаниеТипов("Дата"),,
					НСтр("ru = 'Дата установки'; en = 'Installation date'")));
					
					Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
					
					ГруппаСогласованДО = Форма.Элементы.Добавить(
					"СогласованДО",
					Тип("ГруппаФормы"),
					ГруппаСогласованиеДО);  
					ГруппаСогласованДО.Заголовок = НСтр("en='On approval';ru='На согласовании'");;
					ГруппаСогласованДО.Вид       = ВидГруппыФормы.ОбычнаяГруппа; 
					ГруппаСогласованДО.Поведение = ПоведениеОбычнойГруппы.Всплывающая;
					ГруппаСогласованДО.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.ГиперссылкаЗаголовка;  
					ГруппаСогласованДО.Отображение = ОтображениеОбычнойГруппы.Нет;
					ГруппаСогласованДО.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
					
					СостояниеДО = Форма.Элементы.Добавить("ИнтеграцияС1СДокументооборотом_СостояниеДО", Тип("ПолеФормы"), ГруппаСогласованДО);
					СостояниеДО.ПутьКДанным    = "ИнтеграцияС1СДокументооборотом_СостояниеДО"; 
					СостояниеДО.ТолькоПросмотр = Истина;  
					
					СостояниеДО = Форма.Элементы.Добавить("ИнтеграцияС1СДокументооборотом_УстановилСостояниеДО", Тип("ПолеФормы"), ГруппаСогласованДО);
					СостояниеДО.ПутьКДанным    = "ИнтеграцияС1СДокументооборотом_УстановилСостояниеДО"; 
					СостояниеДО.ТолькоПросмотр = Истина;
					
					СостояниеДО = Форма.Элементы.Добавить("ИнтеграцияС1СДокументооборотом_ДатаУстановкиСостояниеДО", Тип("ПолеФормы"), ГруппаСогласованДО);
					СостояниеДО.ПутьКДанным    = "ИнтеграцияС1СДокументооборотом_ДатаУстановкиСостояниеДО"; 
					СостояниеДО.ТолькоПросмотр = Истина;

					ОбновитьСтатусСогласования(Форма);
			КонецЕсли; 
		КонецЕсли;
	Исключение
	КонецПопытки;
		
КонецПроцедуры


// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ЗаполнитьРеквизитыИзПотребителя.
//
Процедура ЗаполнитьРеквизитыИзПотребителя(Прокси, ОбъектXDTO, СсылкаНаПотребитель) Экспорт
	
	Если СсылкаНаПотребитель.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	
	Если ТипЗнч(ОбъектXDTO) = Тип("Строка") Или ОбъектXDTO = Неопределено Тогда
		ЗаполнитьПеречислениеXDTOИзПотребителя(ОбъектXDTO, СсылкаНаПотребитель, Настройки);
		
	ИначеЕсли ТипЗнч(ОбъектXDTO) = Тип("ОбъектXDTO") Тогда
		ЗаполнитьСсылочныйОбъектXDTOИзПотребителя(Прокси, ОбъектXDTO, СсылкаНаПотребитель, Настройки);
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает признак состояния "Согласован" по данным документооборота.
//
// Параметры:
//   СсылкаНаОбъект - ЛюбаяСсылка - ссылка на объект ИС.
//   ОбновитьСостояние - Булево - требуется ли обновление состояния.
//
// Возвращаемое значение:
//   Булево - состояние согласования в ДО.
//
Функция СогласованВ1СДокументооборот(СсылкаНаОбъект, ОбновитьСостояние = Ложь) Экспорт
	
	ДанныеСогласования = Новый Структура("Состояние,Установил,ДатаУстановки");
	
	Попытка
		
		Если ПараметрыСеанса.ИнтеграцияС1СДокументооборотПарольИзвестен Тогда
			
			Прокси = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ПолучитьПрокси();
			
			Если Прокси <> Неопределено Тогда
				
				УстановитьПривилегированныйРежим(Истина);
				Запрос = Новый Запрос(); 
				Запрос.УстановитьПараметр("Объект", СсылкаНаОбъект);
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				               |	ОбъектыИнтегрированныеС1СДокументооборотом.ТипОбъектаДО КАК ТипОбъектаДО,
				               |	ОбъектыИнтегрированныеС1СДокументооборотом.ИдентификаторОбъектаДО КАК ИдентификаторОбъектаДО
				               |ИЗ
				               |	РегистрСведений.ОбъектыИнтегрированныеС1СДокументооборотом КАК ОбъектыИнтегрированныеС1СДокументооборотом
				               |ГДЕ
				               |	ОбъектыИнтегрированныеС1СДокументооборотом.Объект = &Объект";
				Выборка = Запрос.Выполнить().Выбрать(); 
				УстановитьПривилегированныйРежим(Ложь);
				Если Выборка.Следующий() Тогда
					Запрос = ИнтеграцияС1СДокументооборот3.ТекущаяОбработкаОбъектаЗапрос(Прокси, Выборка.ИдентификаторОбъектаДО, Выборка.ТипОбъектаДО);
					
					Результат = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ВыполнитьЗапрос(Прокси, Запрос);
					
					Если Результат.objectProcessing.actionsRows.rows.Количество() > 0 Тогда
						
						СостояниеПолучено = Истина;
						
						Для Каждого ТекСостояние Из Результат.objectProcessing.actionsRows.rows Цикл
							Если СтрНайти(ТекСостояние.presentation, "Согласование") <> 0 
								ИЛИ СтрНайти(ТекСостояние.presentation, "Approve") <> 0 Тогда
								Если ТекСостояние.actionsRows = Неопределено Тогда
									Если ТекСостояние.statePresentation = "AwaitingApproval"
										ИЛИ ТекСостояние.statePresentation = "На согласовании" Тогда
										Статус = Перечисления.СостоянияСогласованияВДокументообороте.НаСогласовании;
									ИначеЕсли ТекСостояние.statePresentation = "Approved"
										ИЛИ ТекСостояние.statePresentation = "Согласован" Тогда
										Статус = Перечисления.СостоянияСогласованияВДокументообороте.Согласован;
									ИначеЕсли ТекСостояние.statePresentation = "NotApproved"
										ИЛИ ТекСостояние.statePresentation = "Не согласован" Тогда
										Статус = Перечисления.СостоянияСогласованияВДокументообороте.НеСогласован; 
									КонецЕсли;
									ДанныеСогласования.Состояние     = Статус;
									ДанныеСогласования.Установил     = ТекСостояние.employeesPresentation; 
									ДанныеСогласования.ДатаУстановки = ТекСостояние.statusDate;
									Возврат ДанныеСогласования;
								Иначе
									Для Каждого ТекСтрока Из ТекСостояние.actionsRows.rows Цикл 
										Если ТекСтрока.statePresentation = "AwaitingApproval"
											ИЛИ ТекСтрока.statePresentation = "На согласовании" Тогда
											Статус = Перечисления.СостоянияСогласованияВДокументообороте.НаСогласовании;
										ИначеЕсли ТекСтрока.statePresentation = "Approved"
											ИЛИ ТекСтрока.statePresentation = "Согласован" Тогда
											Статус = Перечисления.СостоянияСогласованияВДокументообороте.Согласован;
										ИначеЕсли ТекСтрока.statePresentation = "NotApproved"
											ИЛИ ТекСтрока.statePresentation = "Не согласован" Тогда
											Статус = Перечисления.СостоянияСогласованияВДокументообороте.НеСогласован; 
										КонецЕсли;
										ДанныеСогласования.Состояние     = Статус;
										ДанныеСогласования.Установил     = ТекСтрока.employeesPresentation; 
										ДанныеСогласования.ДатаУстановки = ТекСтрока.statusDate;
										Возврат ДанныеСогласования;
									КонецЦикла;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					Иначе
						ДанныеСогласования = Новый Структура("Состояние,Установил,ДатаУстановки", "Не получено");
					КонецЕсли;
				Иначе
					ДанныеСогласования = Новый Структура("Состояние,Установил,ДатаУстановки");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат ДанныеСогласования;
	
КонецФункции

// Функция возвращает флаг согласования документа
// Параметры:
//	ДокументСсылка - ДокументСсылка - ссылка на документ
//	ОбновитьСостояние - Булево - требуется ли обновление состояния.
//
// Возвращаемое значение:
//	Булево - Флаг согласования документа
//
Функция ДокументСогласован(ДокументСсылка, ОбновитьСостояние = Ложь) Экспорт
	Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	Если НЕ Настройки.ИспользоватьИнтеграциюДО3 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Правила = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.НайтиСоздатьПодходящиеПравила(ДокументСсылка);
	Если Правила.Количество() = 0 Тогда 
		Возврат Истина;
	КонецЕсли;
	СогласованВ1СДокументооборот = уатИнтеграцияС1СДокументооборот.СогласованВ1СДокументооборот(ДокументСсылка, ОбновитьСостояние);
	
	Возврат СогласованВ1СДокументооборот.Состояние = Неопределено
		ИЛИ СогласованВ1СДокументооборот.Состояние = "Не получено"
		ИЛИ СогласованВ1СДокументооборот.Состояние = Перечисления.СостоянияСогласованияВДокументообороте.Согласован;
КонецФункции

// Процедура выполняет обновление текста и цвета надписи статуса согласования
// Параметры:
//	Форма - форма документа
//
Процедура ОбновитьСтатусСогласования(Форма) Экспорт
	
	Если Форма.Элементы.Найти("СогласованиеДО") <> Неопределено Тогда 
		ДанныеСогласования = уатИнтеграцияС1СДокументооборот.СогласованВ1СДокументооборот(Форма.Объект.Ссылка); 
		Если ДанныеСогласования.Состояние <> Неопределено Тогда  
			Форма.Элементы.СогласованиеДО.Видимость = Истина;
			Форма.Элементы._ОбновитьСостояниеСогласованиеДО.Видимость = Истина;
			Если ДанныеСогласования.Состояние = Перечисления.СостоянияСогласованияВДокументообороте.НеСогласован Тогда
				Форма.Элементы.СогласованДО.ЦветТекстаЗаголовка = WebЦвета.Красный;
			ИначеЕсли ДанныеСогласования.Состояние = Перечисления.СостоянияСогласованияВДокументообороте.Согласован Тогда
				Форма.Элементы.СогласованДО.ЦветТекстаЗаголовка = WebЦвета.Зеленый;
			Иначе
				Форма.Элементы.СогласованДО.ЦветТекстаЗаголовка = WebЦвета.Синий;
			КонецЕсли; 
			Форма.Элементы.СогласованДО.Заголовок = ДанныеСогласования.Состояние;
			Форма["ИнтеграцияС1СДокументооборотом_СостояниеДО"]              = ДанныеСогласования.Состояние;
			Форма["ИнтеграцияС1СДокументооборотом_УстановилСостояниеДО"]     = ДанныеСогласования.Установил;
			Форма["ИнтеграцияС1СДокументооборотом_ДатаУстановкиСостояниеДО"] = ДанныеСогласования.ДатаУстановки;
		Иначе 
			Форма.Элементы.СогласованиеДО.Видимость = Ложь;
			Форма.Элементы._ОбновитьСостояниеСогласованиеДО.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьПодразделение(Подразделение, Прокси, ОбъектXDTO, ЗаполнятьПодразделение, ЗаполнятьРуководителя) Экспорт
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		
		ОбъектXDTO.subdivision = МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
			Прокси,
			"DMSubdivision",
			Подразделение,
			ЗаполнятьПодразделение);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьИнформациюОПользователе(Прокси, ОбъектXDTO, СсылкаНаПотребитель) Экспорт
	
	Настройки = Неопределено;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера");
		Настройки = МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	КонецЕсли;
	
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
		ОбъектXDTO.user = МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
			Прокси,
			"DMUser",
			СсылкаНаПотребитель);
	ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
		ОбъектXDTO.employee = МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
			Прокси,
			"DMEmployee",
			СсылкаНаПотребитель);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Используется только для интеграции с ДО 3. Заполняет значение перечисления из XDTO пакета DM.
//
// Параметры:
//   ОбъектXDTO - Строка - значение перечисления.
//   СсылкаНаПотребитель - ЛюбаяСсылка - ссылка на исходный объект конфигурации-потребителя.
//   Настройки - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию
//
Процедура ЗаполнитьПеречислениеXDTOИзПотребителя(ОбъектXDTO, СсылкаНаПотребитель, Настройки)
	
	Если Настройки.ИспользоватьИнтеграциюДО3 = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(СсылкаНаПотребитель) = Тип("ПеречислениеСсылка.ЮридическоеФизическоеЛицо") Тогда
		
		Если СсылкаНаПотребитель = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
			ОбъектXDTO = "LglPerson";
			
		ИначеЕсли СсылкаНаПотребитель = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			ОбъектXDTO = "Individ";
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(СсылкаНаПотребитель) = Тип("ПеречислениеСсылка.СтавкиНДС") Тогда
		
		Если СсылкаНаПотребитель = Перечисления.СтавкиНДС.БезНДС Тогда
			ОбъектXDTO = "WithoutVAT";
			
		ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС0 Тогда
			ОбъектXDTO = "VAT0";
			
		ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС10
				Или СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС10_110 Тогда
			ОбъектXDTO = "VAT10";
			
		ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС18
				Или СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС18_118 Тогда
			ОбъектXDTO = "VAT18";
			
		ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС20
				Или СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС20_120 Тогда
			ОбъектXDTO = "VAT20";
			
		//ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС22
		//		Или СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС22_122 Тогда
		//	ОбъектXDTO = "VAT22";
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСсылочныйОбъектXDTOИзПотребителя(Прокси, ОбъектXDTO, СсылкаНаПотребитель, Настройки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(СсылкаНаПотребитель) = Тип("ПеречислениеСсылка.ЮридическоеФизическоеЛицо") Тогда
		
		Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
			ОбъектXDTO = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
				Прокси,
				"DMLegalPrivatePerson",
				СсылкаНаПотребитель,
				Ложь);
			ОбъектXDTO.objectID.type = "DMLegalPrivatePerson";
			Если СсылкаНаПотребитель = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
				ОбъектXDTO.objectID.ID = "ЮрЛицо"; //@NON-NLS-1
			ИначеЕсли СсылкаНаПотребитель = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
				ОбъектXDTO.objectID.ID = "ФизЛицо"; //@NON-NLS-1
			КонецЕсли;
		ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
			ЗаполнитьПеречислениеXDTOИзПотребителя(ОбъектXDTO, СсылкаНаПотребитель, Настройки);
		КонецЕсли;
			
	//++ Локализация
	ИначеЕсли ТипЗнч(СсылкаНаПотребитель) = Тип("ПеречислениеСсылка.СтавкиНДС") Тогда
		
		Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
			ОбъектXDTO = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
				Прокси,
				"DMVATRate",
				СсылкаНаПотребитель,
				Ложь);
			ОбъектXDTO.objectID.type = "DMVATRate";
			Если СсылкаНаПотребитель = Перечисления.СтавкиНДС.БезНДС Тогда
				ОбъектXDTO.objectID.ID = "БезНДС"; //@NON-NLS-1
			ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС0 Тогда
				ОбъектXDTO.objectID.ID = "НДС0"; //@NON-NLS-1
			ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС5
					Или СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС5_105 Тогда
				ОбъектXDTO.objectID.ID = "НДС5"; //@NON-NLS-1
			ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС7
					Или СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС7_107 Тогда
				ОбъектXDTO.objectID.ID = "НДС7"; //@NON-NLS-1
			ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС10
					Или СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС10_110 Тогда
				ОбъектXDTO.objectID.ID = "НДС10"; //@NON-NLS-1
			ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС18
					Или СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС18_118 Тогда
				ОбъектXDTO.objectID.ID = "НДС18"; //@NON-NLS-1
			ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС20
					Или СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС20_120 Тогда
				ОбъектXDTO.objectID.ID = "НДС20"; //@NON-NLS-1
			ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС22
					Или СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС22_122 Тогда
				ОбъектXDTO.objectID.ID = "НДС22"; //@NON-NLS-1
			КонецЕсли;
		ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
			Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ДоступенФункционалВерсииСервиса("3.0.16.33") Тогда
				ОбъектXDTO = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMVATRateUniversal",
					СсылкаНаПотребитель,
					Ложь);
				Если СсылкаНаПотребитель = Перечисления.СтавкиНДС.БезНДС Тогда
					ОбъектXDTO.predefinedName = "WithoutVAT";
					ОбъектXDTO.rate = 0;
				ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС0 Тогда
					ОбъектXDTO.predefinedName = "VAT0";
					ОбъектXDTO.rate = 0;
				ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС5 Тогда
					ОбъектXDTO.rate = 5;
				ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС5_105 Тогда
					ОбъектXDTO.rate = 5;
					ОбъектXDTO.calculatedRate = Истина;
				ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС7 Тогда
					ОбъектXDTO.rate = 7;
				ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС7_107 Тогда
					ОбъектXDTO.rate = 7;
					ОбъектXDTO.calculatedRate = Истина;
				ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС10 Тогда
					ОбъектXDTO.predefinedName = "VAT10";
					ОбъектXDTO.rate = 10;
				ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС10_110 Тогда
					ОбъектXDTO.predefinedName = "VAT10";
					ОбъектXDTO.rate = 10;
					ОбъектXDTO.calculatedRate = Истина;
				ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС18 Тогда
					ОбъектXDTO.predefinedName = "VAT18";
					ОбъектXDTO.rate = 18;
				ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС18_118 Тогда
					ОбъектXDTO.predefinedName = "VAT18";
					ОбъектXDTO.rate = 18;
					ОбъектXDTO.calculatedRate = Истина;
				ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС20 Тогда
					ОбъектXDTO.predefinedName = "VAT20";
					ОбъектXDTO.rate = 20;
				ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС20_120 Тогда
					ОбъектXDTO.predefinedName = "VAT20";
					ОбъектXDTO.rate = 20;
					ОбъектXDTO.calculatedRate = Истина;
				ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС22 Тогда
					ОбъектXDTO.rate = 22;
				ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС22_122 Тогда
					ОбъектXDTO.rate = 22;
					ОбъектXDTO.calculatedRate = Истина;
				КонецЕсли;
			Иначе
				ЗаполнитьПеречислениеXDTOИзПотребителя(ОбъектXDTO, СсылкаНаПотребитель, Настройки);
			КонецЕсли;
		КонецЕсли;
	// -- Локализация
		
	ИначеЕсли (ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMCorrespondent")
				И ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Контрагенты"))
			Или (ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMOrganization")
				И ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Организации")) Тогда
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаПотребитель,
			"ИНН, КПП, ЮридическоеФизическоеЛицо, КодПоОКПО, НаименованиеПолное");
		
		Если ЗначениеЗаполнено(Реквизиты.ИНН) Тогда
			ОбъектXDTO.inn = Реквизиты.ИНН;
		КонецЕсли;
		Если ЗначениеЗаполнено(Реквизиты.КПП) Тогда
			ОбъектXDTO.kpp = Реквизиты.КПП;
		КонецЕсли;
		Если ЗначениеЗаполнено(Реквизиты.КодПоОКПО) Тогда
			ОбъектXDTO.okpo = Реквизиты.КодПоОКПО;
		КонецЕсли;
		Если ЗначениеЗаполнено(Реквизиты.НаименованиеПолное) Тогда
			ОбъектXDTO.fullName = Реквизиты.НаименованиеПолное;
		КонецЕсли;
		
		ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
			Прокси,
			ОбъектXDTO.legalPrivatePerson,
			Реквизиты.ЮридическоеФизическоеЛицо);
		
	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMPrivatePerson")
			И ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.ФизическиеЛица")
			И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаПотребитель, "ЭтоГруппа") Тогда
		
		СпосокРеквизитов = Новый Массив;
		СпосокРеквизитов.Добавить("ДатаРождения");
		СпосокРеквизитов.Добавить("ИНН");
		СпосокРеквизитов.Добавить("ФИО");
		СпосокРеквизитов.Добавить("СтраховойНомерПФР");
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаПотребитель, СтрСоединить(СпосокРеквизитов, ","));
		
		Если ЗначениеЗаполнено(Реквизиты.ДатаРождения) Тогда
			ОбъектXDTO.birthDay = Реквизиты.ДатаРождения;
		КонецЕсли;
		Если ЗначениеЗаполнено(Реквизиты.ИНН)
				И ИнтеграцияС1СДокументооборотБазоваяФункциональность.СвойствоСуществует(ОбъектXDTO, "inn") Тогда
			ОбъектXDTO.inn = Реквизиты.ИНН;
		КонецЕсли;
		//++ НЕ УТ
		Если ЗначениеЗаполнено(Реквизиты.ФИО) Тогда
			ОбъектXDTO.name = Реквизиты.ФИО;
		КонецЕсли;
		Если ЗначениеЗаполнено(Реквизиты.СтраховойНомерПФР)
				И ИнтеграцияС1СДокументооборотБазоваяФункциональность.СвойствоСуществует(ОбъектXDTO, "retirementInsuranceNumber") Тогда
			ОбъектXDTO.retirementInsuranceNumber = Реквизиты.СтраховойНомерПФР;
		КонецЕсли;
		//-- НЕ УТ
		
	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMBankAccount")
			И ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаПотребитель, "Владелец, Банк, НомерСчета");
		
		ОбъектXDTO.number = Реквизиты.НомерСчета;
		
		Если ЗначениеЗаполнено(Реквизиты.Владелец) Тогда
			Если ТипЗнч(Реквизиты.Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда
				ИмяТипаXDTO = "DMCorrespondent";
			ИначеЕсли ТипЗнч(Реквизиты.Владелец) = Тип("СправочникСсылка.Организации") Тогда
				ИмяТипаXDTO = "DMOrganization";
			КонецЕсли;
			ОбъектXDTO.owner = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
				Прокси,
				ИмяТипаXDTO,
				Реквизиты.Владелец);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Реквизиты.Банк) Тогда
			ОбъектXDTO.bank = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
				Прокси,
				"DMBank",
				Реквизиты.Банк);
		КонецЕсли;
		
	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMUser") Тогда
		
		Если ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Пользователи") Тогда
			Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаПотребитель, "Подразделение");
			Если ЗначениеЗаполнено(Подразделение) Тогда
				ОбъектXDTO.subdivision = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMSubdivision",
					Подразделение);
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Сотрудники") Тогда
			Справочники.Сотрудники.ЗаполнитьРеквизитыОбъектаДокументооборота(Прокси, ОбъектXDTO, СсылкаНаПотребитель);
		КонецЕсли;
		
		Если ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Пользователи.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|ГДЕ
				|	Пользователи.ФизическоеЛицо = &ФизическоеЛицо
				|	И НЕ Пользователи.ПометкаУдаления");
			Запрос.УстановитьПараметр("ФизическоеЛицо", СсылкаНаПотребитель);
			
			ВыборкаПользователи = Запрос.Выполнить().Выбрать();
			
			Если ВыборкаПользователи.Количество() = 1 Тогда
				ВыборкаПользователи.Следующий();
				ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
					Прокси,
					ОбъектXDTO,
					ВыборкаПользователи.Ссылка);
				
			Иначе
				ОбъектXDTO.privatePerson = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMPrivatePerson",
					СсылкаНаПотребитель);
				
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMEmployee") Тогда
		
		//Если ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Сотрудники") Тогда
		//	Справочники.Сотрудники.ИнтеграцияС1СДокументооборотЗаполнитьДанныеСотрудника(
		//		Прокси,
		//		ОбъектXDTO,
		//		СсылкаНаПотребитель);
		//	ОбъектXDTO.externalObject = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьExternalObject(
		//		Прокси,
		//		СсылкаНаПотребитель);
		//	КонецЕсли;
			
		Если ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Пользователи") Тогда
			ЗапросПользователь = Новый Запрос(
				"ВЫБРАТЬ
				|	Пользователи.ФизическоеЛицо.Наименование КАК ФизическоеЛицоНаименование,
				|	Пользователи.Подразделение КАК Подразделение
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|ГДЕ
				|	Пользователи.Ссылка = &Пользователь");
			ЗапросПользователь.Текст = СтрЗаменить(
				ЗапросПользователь.Текст,
				"Пользователи.ФизическоеЛицо.Наименование",
				"Пользователи.ФизическоеЛицо.ФИО");
			ЗапросПользователь.УстановитьПараметр("Пользователь", СсылкаНаПотребитель);
			
			ВыборкаПользователь = ЗапросПользователь.Выполнить().Выбрать();
			Если ВыборкаПользователь.Следующий() Тогда
				
				Если ЗначениеЗаполнено(ВыборкаПользователь.ФизическоеЛицоНаименование) Тогда
					ОбъектXDTO.name = ВыборкаПользователь.ФизическоеЛицоНаименование;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаПользователь.Подразделение) Тогда
					ОбъектXDTO.subdivision = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
						Прокси,
						"DMSubdivision",
						ВыборкаПользователь.Подразделение);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			ЗапросПользователь = Новый Запрос(
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Пользователи.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|ГДЕ
				|	Пользователи.ФизическоеЛицо = &ФизическоеЛицо
				|	И НЕ Пользователи.ПометкаУдаления");
			ЗапросПользователь.УстановитьПараметр("ФизическоеЛицо", СсылкаНаПотребитель);
			
			ВыборкаПользователи = ЗапросПользователь.Выполнить().Выбрать();
			
			Если ВыборкаПользователи.Количество() = 1 Тогда
				ВыборкаПользователи.Следующий();
				ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
					Прокси,
					ОбъектXDTO,
					ВыборкаПользователи.Ссылка);
				
			Иначе
				ОбъектXDTO.privatePerson = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMPrivatePerson",
					СсылкаНаПотребитель);
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Сотрудники") Тогда
			Справочники.Сотрудники.ЗаполнитьРеквизитыОбъектаДокументооборота(Прокси, ОбъектXDTO, СсылкаНаПотребитель);
			
		КонецЕсли;
		
	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMParty") Тогда
		
		Если ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Контрагенты") Тогда
			ОбъектXDTO.correspondent = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
				Прокси,
				"DMCorrespondent",
				СсылкаНаПотребитель);
			
		ИначеЕсли ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Организации") Тогда
			ОбъектXDTO.organization = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
				Прокси,
				"DMOrganization",
				СсылкаНаПотребитель);
			
		ИначеЕсли ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Пользователи")
				Или ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
				ОбъектXDTO.user = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMUser",
					СсылкаНаПотребитель);
			ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
				ОбъектXDTO.employee = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMEmployee",
					СсылкаНаПотребитель);
			КонецЕсли;
			
			
		КонецЕсли;
		
	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMPartyRowContact") Тогда
		
		Если ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.КонтактныеЛица") Тогда
			ОбъектXDTO.contactPerson = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
				Прокси,
				"DMContactPerson",
				СсылкаНаПотребитель);
			
		ИначеЕсли ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Пользователи")
				Или ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
				ОбъектXDTO.user = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMUser",
					СсылкаНаПотребитель);
			ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
				ОбъектXDTO.employee = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMEmployee",
					СсылкаНаПотребитель);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Сотрудники") Тогда
			Справочники.Сотрудники.ЗаполнитьРеквизитыОбъектаДокументооборота(Прокси, ОбъектXDTO, СсылкаНаПотребитель);
		КонецЕсли
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти
